socialNetwork/wrk2/custom-scripts/outputs-without-istio/rps_50/4
Running 1m test @ http://128.199.25.250:31111/wrk2-api/home-timeline/read
  2 threads and 100 connections
  Thread calibration: mean lat.: 27.006ms, rate sampling interval: 72ms
  Thread calibration: mean lat.: 26.151ms, rate sampling interval: 75ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    40.38ms   31.90ms 153.34ms   90.00%
    Req/Sec    24.73     96.44   520.00     93.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.04ms
 75.000%   45.73ms
 90.000%   72.25ms
 99.000%  153.34ms
 99.900%  268.80ms
 99.990%  283.14ms
 99.999%  283.14ms
100.000%  283.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.831     0.000000            1         1.00
      16.359     0.100000          247         1.11
      19.951     0.200000          493         1.25
      22.991     0.300000          736         1.43
      26.575     0.400000          981         1.67
      31.039     0.500000         1228         2.00
      33.055     0.550000         1348         2.22
      35.903     0.600000         1470         2.50
      38.335     0.650000         1592         2.86
      41.119     0.700000         1715         3.33
      45.727     0.750000         1837         4.00
      48.415     0.775000         1898         4.44
      53.407     0.800000         1964         5.00
      57.855     0.825000         2021         5.71
      63.455     0.850000         2082         6.67
      67.903     0.875000         2143         8.00
      69.567     0.887500         2174         8.89
      72.447     0.900000         2205        10.00
      78.463     0.912500         2235        11.43
      88.191     0.925000         2266        13.33
      93.951     0.937500         2296        16.00
      98.431     0.943750         2312        17.78
     103.103     0.950000         2327        20.00
     106.239     0.956250         2342        22.86
     118.207     0.962500         2358        26.67
     121.343     0.968750         2373        32.00
     123.071     0.971875         2381        35.56
     125.951     0.975000         2388        40.00
     127.359     0.978125         2396        45.71
     130.175     0.981250         2404        53.33
     134.271     0.984375         2411        64.00
     138.239     0.985938         2415        71.11
     141.183     0.987500         2419        80.00
     143.359     0.989062         2423        91.43
     162.815     0.990625         2427       106.67
     163.967     0.992188         2430       128.00
     182.399     0.992969         2432       142.22
     253.951     0.993750         2434       160.00
     256.767     0.994531         2436       182.86
     257.791     0.995313         2438       213.33
     258.431     0.996094         2441       256.00
     258.431     0.996484         2441       284.44
     259.071     0.996875         2442       320.00
     261.375     0.997266         2443       365.71
     264.447     0.997656         2444       426.67
     265.215     0.998047         2445       512.00
     265.215     0.998242         2445       568.89
     265.727     0.998437         2446       640.00
     265.727     0.998633         2446       731.43
     268.799     0.998828         2447       853.33
     268.799     0.999023         2447      1024.00
     268.799     0.999121         2447      1137.78
     272.383     0.999219         2448      1280.00
     272.383     0.999316         2448      1462.86
     272.383     0.999414         2448      1706.67
     272.383     0.999512         2448      2048.00
     272.383     0.999561         2448      2275.56
     283.135     0.999609         2449      2560.00
     283.135     1.000000         2449          inf
#[Mean    =       40.379, StdDeviation   =       31.902]
#[Max     =      282.880, Total count    =         2449]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2902 requests in 1.00m, 563.96KB read
  Socket errors: connect 0, read 0, write 0, timeout 110
Requests/sec:     48.35
Transfer/sec:      9.40KB